"""
Библиотека имён слоёв
"""
kcn = {"ООПТ": "Леса ООПТ", "ВОДООХРАНН": "Водоохранные", "ЛЕСА НАУЧ": "Науч. или ист. значение",
       "ЗОНЫ САНОХРАН": "Зона Санохраны. Водоснабжен.", "ЗЕЛЁНЫЕ ЗОНЫ": "Зелёные зоны", "ГОРНЫЕ ЛЕСА": "Горные леса",
       "ГОРНО-САНИТАРНЫЕ ЛЕСА": "Горно-санитарные леса", "ПРОТИВОЭРОЗИОНН": "Противоэрозионные",
       "ПЛОДОВЫЕ": "Лесные плодовые насаждения", "ОРЕХО-ПРОМЫСЛОВЫЕ": "Орехо-промысловые зоны",
       "НЕРЕСТООХРАНН": "Нерестоохранные", "ЗАЩИТНЫЕ ПОЛОСЫ": "Защитные полосы", "РЕЗЕРВНЫЕ ЛЕСА": "Резервные леса",
       "ГОРОДСКИЕ ЛЕСА": "Городские леса", "ЛЕСОПАРКОВЫЕ": "Лесопарковые зоны", "ЗАПРЕТНЫЕ ПОЛОСЫ": "Запретные полосы",
       "ГОСУДАРСТВЕННЫЕ": "Государственные лесополосы", "ЛЕСОТУНДРОВЫЕ": "Лесотундровые леса",
       "ЛЕСОСТЕПНЫЕ": "Лесостепные леса", "ПУСТЫНН": "Пустынные, полупустын. Леса", "ЛЕНТОЧНЫЕ БОРЫ": "Ленточные боры",
       "ЭКСПЛУАТАЦИОННЫЕ": "Эксплутационные леса"}
ozu = {"БЕРЕГОЗАЩИТ": "Берегозащитные участки", "БОБР": "Бобровые поселения", "ГЛУХАРИН": "Глухариные тока",
       "ЗАПРЕТ СПЛОШ": "Запрет сплош руб", "ПРОБНЫЕ": "Постоянные пробные площади", "КРУТЫЕ": "Крутые склоны",
       "ВДОЛЬ ДОРОГ": "Опушки леса вдоль дорог", "ПУНКТОВ": "Уч-ки вокруг нас пунктов", "ЭТАЛОНЫ": "Участки эталоны",
       "ЛЕСОСЕМЕННЫЕ ПЛАНТАЦИИ": "Лесосеменные плантации", "ПОСТОЯННЫЕ ЛЕСОСЕМЕННЫЕ": "Постоян. лесосем. участки",
       "МЕДОНОСНЫЕ": "Медоносные участки лесов", "ПЛЮСОВЫЕ": "Плюсовые насаждения", "МАТОЧНЫЕ": "Маточные плантации",
       "ГЕОГРАФ": "Географические культуры", "ИСПЫТАТЕЛЬНЫЕ": "Испытательные культуры", "ЭТАЛОН": "Участки эталоны",
       "СКАЛЬНИК": "Скальники", "ЗАПОВЕДН": "Заповедные л. участки", "АРХИВ": "Архивы клонов плюс. дер.",
       "СОЛОНЦ": "Уч-ки вокруг ест. солонцов", "БЕЗЛЕСН": "Опушки с безлесн. простр.",
       "ПОЧВОЗАЩИТ": "Почвозащитные участки", "<100": "Уч.ср.безлес.прост.<100га", "МАРШ": "Полосы по трас. тур.маршр.",
       "ВОДОРАЗД": "Полосы по гребн. водоразд.", "ЛЕЧЕБН": "Зоны вокруг лечебн.учреж.",
       "РЕЛИКТ": "Уч-ки с реликтовыми пор.", "200": "Полосы 200м верх.гр.леса", "МИНЕР": "Леса вокруг минер. источ.",
       "ДЕРЕВЬЯМИ": "Участки с плюс. деревьями", "НАСЛЕД": "Объект природного наследия",
       "ОБИТАН": "Места обитан.исчез.видов", "ПОПУЛЯЦИОН": "Популяцион.-эколог. культ.",
       "ПРОТИВОЭРОЗ": "Противоэроз.участки", "РЕКУЛЬТИВИРОВАНН": "Рекультивированные уч-ки",
       "50 кбм": "50 кбм/га и менее в спелых", "ПРОЧИЕ ВИДЫ": "Прочие виды исключений",
       "КАРСТ": "Леса на карст.образов.", "НАУЧНО-ИССЛЕДОВ": "Научно-исследов.участки",
       "ГЕНЕТИЧЕСК": "Генетические резерваты", "ЦЕННЫМ": "Уч-ки с ценными породами",
       "ФИНСКОГО": "О-ва Финского зал.и Вуоксы", "ЗОНА ЧАСТ": "Зона част.хоз. использов-я"}
# Объекты гидрологической сети
gidr = {"ГИДР": "Гидрография", "РУЧЬИ": "Ручей", "РУЧЕЙ": "Ручей", "КАНАЛ": "Каналы", "КАНАВЫ": "Канавы"}
# Объекты инфраструктуры
infr = {"ЖЕЛЕЗН": "ЖД", "ЖД": "ЖД", "АВТО": "Автомобильные", "ГРУНТ": "Дорога грунтовая", "ЗИМНИК": "Зимник",
        "ТРОПА": "Тропа", "ТРОПЫ": "Тропа", "ЛЕСН": "Лесная дорога", "ЛЕСОВОЗ": "Дорога лесовозная",
        "ГРАНИЦ": "Граница", "ЛЭП": "ЛЭП", "ГАЗ": "Газопровод", "ТЕЛЕФОН": "Телефонная линия", "НЕФТ": "Нефтепровод",
        "ЛИНИЯ": "Телефонная линия", "СВЯЗЬ": "Телефонная линия", "СВЯЗИ": "Телефонная линия", "МЕЛИОРАЦ": "Мелиорация",
        "ПОЖАР": "Пр.пожарный разрыв", "ПРОЧИЕ ТРАС": "Прочие трассы", "ВОДОПРОВОД": "Водопровод"}
